import numpy as np

# 5 вариант
A = np.array([
    [5.526, 0.305, 0.887, 0.037],
    [0.658, 2.453, 0.678, 0.192],
    [0.398, 0.232, 4.957, 0.567],
    [0.081, 0.521, 0.192, 4.988]
])
f = np.array([0.774, 0.245, 0.343, 0.263])

# 1. Решение методом Гаусса
print("========= 1. Решение методом Гаусса с выбором главного элемента =========")

def gauss_pivot(A_in, f_in):
    A = A_in.copy()
    f = f_in.copy().astype(float)
    n = len(f) # размерность системы
    # Прямой ход (приведение матрицы к верхнетреугольному виду)
    for i in range(n):
        # Выбор главного элемента столбца
        max_el = abs(A[i:, i]).argmax() + i 
        # Перестановка строк
        A[[i, max_el]] = A[[max_el, i]]
        f[[i, max_el]] = f[[max_el, i]]
        # Исключение неизвестных (обнуление элементов под диагональю)
        for j in range(i+1, n):
            m = A[j, i] / A[i, i]
            A[j, i:] -= m * A[i, i:]
            f[j] -= m * f[i]
    # Обратный ход
    x = np.zeros(n) # пустой вектор решений
    for i in range(n-1, -1, -1): # последовательно находим u от 4 до 1
        x[i] = (f[i] - np.dot(A[i, i+1:], x[i+1:])) / A[i, i]
    return x

U_gauss = gauss_pivot(A, f)
print(f"Вектор U решения системы уравнений: {U_gauss}\n")

# 2. Метод простой итерации
print("========= 2. Решение методом простой итерации =========")

# Приведение системы к виду u = B*u + F
tau = 0.15 # Выбираем методом подбора для обеспечения сходимости
E = np.eye(4)
B = E - tau * A
F = tau * f
eps = 0.01

print("=== Матрица B ===")
print(B)
print("=== Вектор F ===")
print(F)

# Проверка условия сходимости (норма матрицы B)
q = np.linalg.norm(B, ord=1) 
print(f"Параметр tau: {tau}")
print(f"Норма матрицы B (q): {q:.5f}")

# Итерационный процесс
u_k = np.zeros(4) # начинаем с нулевого приближения
k = 0
print("\n=== Итерации ===")
while True:
    k += 1
    u_next = np.dot(B, u_k) + F # вычисление след. приближения
    
    # Норма разности между соседними 
    diff_norm = np.linalg.norm(u_next - u_k, ord=1)
    stop_crit = (1 / (1 - q)) * diff_norm # критерий остановки
    
    # Вектор погрешности epsilon_k = u_k - U
    err_vec = u_next - U_gauss
    
    print(f"Итерация {k}: u = {u_next}, ||eps_k|| = {np.linalg.norm(err_vec, ord=1):.6f}")
    
    if stop_crit < eps: # решение достаточно точное
        break
    u_k = u_next

print(f"\nПотребовалось итераций для решения: {k}.")